{"pages":[{"url":"archives.html","text":"Solutions 2017 2016 2015 2014 2013 2012 2011 Rankings 2017 2016 2015","tags":"pages","title":"Archives"},{"url":".","text":"Welcome to #ircpuzzles ! We are an IRC -based puzzle game. Our home is currently in #ircpuzzles on chat.freenode.net. We host the annual April Fool's Puzzle and Challenges every year on April 1st as part of our celebration for April Fool's Day. History Prior to #ircpuzzles , a yearly festival of puzzles was created and managed by freenode staff. yano participated among other staff in the adventure for several years, from 2012 to 2014. In 2013, due to an overwhelming amount of volunteers and individuals who wanted to contribute, yano created #ircpuzzles . #ircpuzzles was created as a way to run and manage future April Fool's Day competitions from non-freenode staff. In 2014, #ircpuzzles held its first annual April Fool's Day Puzzle Competition. And #ircpuzzles has been hosting a yearly competition every April 1st since then. And the rest is history.","tags":"pages","title":"Home"},{"url":"rules.html","text":"No flooding. No use of ALL CAPS text. Turn off your caps lock. No additional bots in the channel. Only ChanServ and jenni are allowed. No automated scripts. (eg: No automatic /me's or messages when you go \"away\") No personal insults. English is the preferred language, other languages are allowed but in small amounts. Please try to use English as the primary language for communication. As always do not violate any freenode policies: https://freenode.net/policies Do NOT share anything from the /topics in any of the previous levels.","tags":"pages","title":"Rules"},{"url":"staff.html","text":"The following is a list of our current staff and volunteers: apoc Arch- TK FireFly furry grumble jose josePhoenix mniip sdamashek tris_emmy vehk yano ybden","tags":"pages","title":"Staff"},{"url":"tips.html","text":"This is a running and non-comprehensive list of \"Guidelines\" or things to know that can help out. All levels will always start with ###### (6-six) octothorpes. The official channels will be registered to the IRC account of ircpuzzles . You can quickly see if a channel exists with /mode ######channel_name freenode channel names are NOT case sensitive. The clue is, by itself, the main puzzle for each level. The hints are to help point you in the right direction with the clue . freenode's maximum channel name length is 50-characters (including the # hashes). Important The ircpuzzles account has the cloak @ircpuzzles/official","tags":"pages","title":"Tips & Guidelines"},{"url":"2018/03/2018-afpc-announcement/","text":"The 2018 #ircpuzzles' April Fool's Puzzle Competition will begin on 2018-03-31 12:00 UTC ! We will announce the first clue in #ircpuzzles on chat.freenode, on our website, and on our Twitter handle @ircpuzzles .","tags":"updates","title":"2018 April Fool's Puzzle Competition"},{"url":"2018/03/2017-afd-summary/","text":"Level 0 Clue: IyMjIyMjTlNRMjAxN0ZnbmVnLVBlbGNnYkFyamY= The answer: ######AFD2017Start-CryptoNews decoding the clue with base64, and then rot13 Level 1 Clues: NFRHI4TENB4WC5DBMF2GWYY = | 1<<5 From 1<<5 , participants were expected to arrive at base32 Decoding the first clue using base32 yields: ibtrdhyataatkc Swapping each pair of letters results in ######birthdayattack Level 2 Clues: Common Vulnerabilities and Exposures | Stocks A quick Google search finds Cenovus Energy, of which the TSX and NYSE is CVE The answer: ######CenovusEnergy Level 3 Clues: 0154 0252 0158 0254 0236 0231 0239 0244 0250 0154 | ⎇ | http://i.imgur.com/hGNGTd8.png Using the last two hints, people were expected to arrive at https://en.wikipedia.org/wiki/Alt_code Looking up the alt codes results in šüžþìçïôúš The answer: ######suspicious Level 4 Clues: On light clouds of the upper zone, Pillows meet for our reclining, We may rest while day is shining. | https://i.imgur.com/XAyi8DY.png | CVE The first clue is an excerpt of Nimrod , a poem by Robert William Jameson The second clue consists of the logo of Avira, a security software company - and a trailing m Nimrod Aviram was one of the original reporters of the DROWN attack The answer: ######CVE-2016-0800 Level 5 Clues: 1487289600 - 1487894400 | answer is rot13'd The first clue consists of two dates, giving a range in which the Cloudbleed bug was discovered and discussed The answer, after applying the second clue: ######PybhqOyrrq Level 6 Clues: https://is.gd/gGJ0T0 | Append \"Schneier\" to solution | Sigma | Ouroboros | reverse, apply | The first URL points to an image of a whirlpool Participants were expected to realized the connection between what the image portrays and the WHIRLPOOL hashing algorithm Experimentation, or applying the last few hints, was expected to lead to people looking at the WHIRLPOOL hash of the image itself The answer: ######facadeSchneier Level 7 Clues: 31.198056, 121.336389 | https://is.gd/HJJX2m | Ш | Append \"Blue\" to solution | family Each of the first three clues resolves to SHA Three SHAs, or SHA -3 Hunting on wikipedia for SHA -3 was expected to lead people to Keccak, a cryptographic primitive family The answer: ######keccakBlue Level 8 Clues: Tq\\uGTwqtt | Append \"ShakeIt\" to solution | pattern Converting the first hint into a stream of bits results in morse code (in the form of 1-bits interspersed between 0-bits) The answer, after applying the second hint: ######StubbornShakeIt Level 9 Clues: ######quadrooter | sms | Международная организация по стандартизации The quadrooter channel linked to the music video of Call Me Maybe Players were expected to type quadrooter on a mobile phone keyboard The answer: ######778823777666666833777 Level 10 Clues: https://is.gd/qLde0I | Hertz The URL pointed to an audio file Examining the spectrogram of said file was expected to make people realize they were looking at bytes The least significant bit is represented by a frequency around 1.9kHz, whilst the most significant bit is represented by a frequency around 7.5kHz Decoding the bytes as ASCII leads to: BerenstainBears The answer: ######BerenstainBears Level 11 Clues: https://is.gd/b9oNHn | free speech Each colour of the flag corresponds to three ASCII characters (one per colour channel), plus a final character at the end The answer: ######CouNTEriNtUiTIvE Level 12 Clues: E7 D2 C3 C4 40 C3 D3 C9 C9 C9 | xkcd.com/927 | ♫ The bytes given as the first clue were expected to be interpreted as EBCDIC This yields XKCD CLIII - https://www.xkcd.com/153/ The comic in question contains a reference to Missy Elliott Players were expected to hit search engines and come up with… The answer: ######WorkIt Level 13 Clues: KPCfjoIzMiAtIENWRS0tKSArICjwn5Kp8J+QhCAtIENWRS0tKQo= | arithmetic Decoding the first clue using base64 results in (🎂32 - CVE--) + (💩🐄 - CVE--) The emoji hint at Sweet32 and Dirty COW Corresponding CVEs are 2016-2183 and 2016-5195 Using the last hint, people were expected to add 20162183 and 20165195, resulting in… The answer: ######40327378 Level 14 Clues: https://is.gd/VXqYzD | 字 | ローマ字 The linked picture is a nonogram - solving it results in the kanji 没: drown The second and third clue (字: character/word, ローマ字: romanization) hint at the Japanese translation for drown The answer: ######oboreru Level 15 Clues: MSAyIDIgMSAxIDIgMiAyIDMgMCAxIDIKMiAzIDAgMyAzIDEgMyAxIDEgMyAyIDEKMiAwIDAgMiAyIDAgMiAwIDAgMSAwIDIK | touch | ⚅ | U+2800 Decoding the first clue using base64 yields: 1 2 2 1 1 2 2 2 3 0 1 2 2 3 0 3 3 1 3 1 1 3 2 1 2 0 0 2 2 0 2 0 0 1 0 2 Converting each number into binary form: 01 10 10 01 01 10 10 10 11 00 01 10 10 11 00 11 11 01 11 01 01 11 10 01 10 00 00 10 10 00 10 00 00 01 00 10 The last three hints were expected to lead people to try decoding the bits as braille The answer: ######marc.stevens","tags":"solutions","title":"2017 April Fool's Day Summary & Solutions"},{"url":"2018/02/2017-april-fools-rankings/","text":"Thank you for everybody who particpiated! Congratulations to those who finished! nikuhodai , 2017-04-05 13:46:39 mark2222 , 2017-04-07 07:38:24 siracusa , 2017-04-13 14:39:28 BlueShark , 2017-04-13 14:50:08 zgrep , 2017-04-13 15:22:25 stac , 2017-04-15 23:29:41 Omniflux , 2017-04-16 04:45:33 ESphynx/ecere , 2017-04-16 06:13:25 Snicksie , 2017-04-23 22:51:10","tags":"rankings","title":"2017 April Fool's Day Rankings"},{"url":"2017/04/2016-april-fools-rankings/","text":"Thank you for everybody who particpiated! Congratulations to those who finished! vehk 2016-04-06 17:09:38 nikuhodai 2016-04-06 19:34:56 jarainf 2016-04-07 00:49:22 mniip 2016-04-09 02:35:58 homerj 2016-04-12 18:23:22 stac 2016-04-18 11:08:02 Omniflux 2016-04-19 03:32:19 brrr 2016-04-21 00:15:28","tags":"rankings","title":"2016 April Fool's Day Rankings"},{"url":"2017/04/2015-april-fools-rankings/","text":"Thank you for everybody who particpiated! Congratulations to those who finished! pdx 2015-04-03 07:48:34 FireFly 2015-04-03 13:56:34 xnr 2015-04-03 14:22:38 Arch- TK 2015-04-03 18:08:12 slidercrank 2015-04-03 23:13:19 egrep 2015-04-04 00:15:29 jacksonmj 2015-04-04 01:35:02 Omniflux 2015-04-04 06:29:40 nyuszika7h 2015-04-04 10:44:54 larina 2015-04-04 14:45:48","tags":"rankings","title":"2015 April Fool's Day Rankings"},{"url":"2017/04/2017-april-fools-day-challenge-live/","text":"We are happy to present the 2017 IRCPuzzles April Fool's Day Challenge on freenode ! It has begun! The first clue is: IyMjIyMjTlNRMjAxN0ZnbmVnLVBlbGNnYkFyamY= Please join us in #ircpuzzles on freenode.","tags":"updates","title":"2017 April Fool's Day Challenge Is Now LIVE"},{"url":"2017/03/2015-afd-summary/","text":"Level -2 Clue: morning light The answer: ####east ; the cardinal direction in which the sun rises Level -1 Clue: red, orange, yellow, green, blue, indigo, violet The answer: ####colours Level 0 Clue: dHN3aWZ0 This is a base64-encoded string It decodes to \"tswift\", making ####tswift the answer channel Level 1 Clue: ZnVueHIgdmcgYnNz This is yet again a base64-encoded string, yielding \"shake it off\" The answer: ####shakeitoff Level 2 Clue: o3yhLKttMzAhpUV= This puzzle introduced a twist to the base64-encoding. The answer string was encoded with rot13, then with base64, and then rot13 again The answer: ####blankspace Level 3 Clue: 576657787553509376 With the established theme of Taylor Swift, and references to the @SwiftOnSecurity account on twitter, people were expected to use the clue given in the topic as a tweet ID https://twitter.com/SwiftOnSecurity/status/576657787553509376 The answer: ####collisions Level 4 Clue: 582367866915307520 Another tweet ID , this time linking to: https://twitter.com/-/status/582367866915307520 The answer: ####JeremyBentham Level 5 Clues: Commando | Summer People were expected to take the clues in context with the established theme Taylor Swift is an alumni of the Hendersonville High School, which has the \"Commando\" football team The answer: ####HendersonvilleHighSchool Level 6 Clues: Oqritwq | theme This was the first real crypto puzzle The first clue is encrypted with they Vigenère cipher, and the second clue hints at the key to use Decrypting \"Oqritwq\" with \"TaylorAlisonSwift\" (the actual key used is \"TaylorA\") yields: \"upsweep\" The answer: ####upsweep Level 7 Clue: KBPVW ZOYKY LVISX WPVOC OGOSL ZADMK AZCZX DYBGD ZITEY VJPVL YLVPK YSDOH MJYKK UGBZD XCAXX F This is another Vigenère-encoded string, with the channel name as the key Decoding it yields: FRISB EETAR IANIS MISTH EBELI EFTHA TWHEN YOUDI EYOUR SOULG OESUP ONTHE ROOFA NDGET SSTUC K That is a quote from George Carlin: \"Frisbeetarianism is the belief that when you die your soul goes up on the roof and gets stuck.\" The answer: ####georgecarlin Level 8 Clue: zlsikmunfepvgnrfftwvbulqamfiqpvqbsxwlumluictcnfolhlljrzmwhutlbjvivbhafxxpqgsxwlumlusiusilsjt At this point, people were expected to try out different ciphers. The Autokey cipher is an extension to the classic Vigenère cipher The clue in the topic is encrypted with it (keyword georgecarlin , the channel name), yielding: thereisnothingnobleinbeingsuperiortoyourfellowmantruenobilityisbeingsuperiortoyourformerself This is a quote from Ernest Hemingway:\"There is nothing noble in being superior to your fellow man true nobility is being superior to your former self\" The answer: ####hemingway Level 9 Clues: Fire | WMJ | TFRWV STQMU FWNGQ DJFOD VUQXJ EDWAN GSCKL KRDKA PIPWY ENQXF JWGGQ HDCIA NM The first two clues hint at Billy Joel's song \"We Didn't Start the Fire\". WMJ are the initials of Joel's real name, William Martin Joel Looking up the lyrics for \"We Didn't Start the Fire\", one finds: \"Hemingway, Eichmann, Stranger in a Strange Land [..]\" People were expected to try out different keys, the channel name hinting at the line above The third clue is a string encrypted with Vigenère Decrypting that string with the key eichmann yields: YOUEI THERD IEAHE ROORL IVELO NGENO UGHTO SEEYO URSEL FBECO METHE VILLI AN \" You either die a hero or live long enough to see yourself become the villian[sic]\" This is a quote from the Christopher Nolan movie \"The Dark Knight\", spoken by Harvey Dent The answer: ####HarveyDent Level 10 Clue: https://git.io/j5J9 Opening the gist yields: Sm9pbiAjIyMjeHN2NHp1aHdlNWxkNGY0aWo1M2EgYW5kIHNheTogIkkgbG92ZSBUYXlsb3IgU3dpZnQhIEhlciBtdXNpYyBpcyBhbWF6aW5nISI= Decoding this string with base64 results in: Join ####xsv4zuhwe5ld4f4ij53a and say: \"I love Taylor Swift! Her music is amazing!\" The topic of ####xsv4zuhwe5ld4f4ij53a is: You have won the game! | TAYLOR SWIFT IS THE MOST AMAZING MUSICIAN EVER !","tags":"solutions","title":"2015 April Fool's Day ( AFD ) Summary & Solutions"},{"url":"2017/03/2016-afd-summary/","text":"Level 0 Clue: IyMjIyMjQUZEMjAxNlN0YXJ0 The answer: ######AFD2016Start , decoding the clue with base64 Level 1 Clue: IyMjIyMjWm54ckN5aGdiTkN5bmFyZ050bnZh Like in the previous puzzle, the clue is encoded with base64, but additionally obscured by rot13 The answer: ######MakePlutoAPlanetAgain Level 2 Clue: Vmxad1ZsWndIM091TEpTdUxKU3VMSlN1TEpTdUxKU3VMMkF3TDJJeU1KSXkK Another combination of base64 and rot13 The answer: ######Spaaaaaaaaaaaaaaaacccceeeee Level 3 Clues: Planets | https://i.imgur.com/SuQkEZ3.png Words to fill in: Mercury Venus Earth Mars Jupiter Saturn Uranus Neptune The answer: ###### YURNSUEATA Level 4 Clues: Заря́ | Red Sky Glow Заря́ literally means \"Red Sky Glow\" or \"Aurora\" Zarya, the English name for Заря́, was the first module of the ISS to be launched The answer: ######Zarya Level 5 Clues: oh my gods | https://i.imgur.com/Zj30Cxx.png Words: Gaia Cytherea Cronus Uranus Cronos Poseidon Ares Zeus The answer: ###### NIANEHAYUI Level 6 Clues: 011-012-013-014-015-040 | do as I do (mimic) | encode | 124-110-111-123 | 8 | white The numbers from the first clue are all whitespace characters in ASCII The second and third hint explain what to do with this information. Encoding the word \"whitespace\" like this yields \"127-110-111-124-105-123-120-101-103-105\" The rest of the hints were added later, with 124-110-111-123 decoding to \" THIS \", 8 hinting at 8-bit codes, and white hinting at \"white\" space The answer: ######127-110-111-124-105-123-120-101-103-105 Level 7 Clues: beetle juice | radiation | space people | 224 | the bright dots | the bright moving dots | a very very bright dot | nothingness | america's success | soviets's success | https://i.imgur.com/Aw7Y43r.png Words: beetle juice -> Betelgeuse radiation -> radiation space people -> astronaut 224 -> andromeda the bright dots -> stars the bright moving dots -> planets a very very bright dot -> sun nothingness -> vacuum america's success -> apollo soviet's success -> sputnik The answer: ######oerbnanrao Level 8: Clues: Carl Sagan | https://is.gd/Xkp0t4 | https://is.gd/swo2JH The pictures are from the images on the Voyager Golden Record The answer: ######voyagergoldenrecord Level 9: Clues: large galaxy, not small (3 words) | pretty lights | same length | definitely not the same length | kaboom | a few stars in orion | a radius | claudius | harry potter character | not space | https://i.imgur.com/xEn26m0.png <- VERSION #3 | number of words The topic changed numerous times, with hints also added to the crossword image itself Words: large galaxy, not small -> Large Magellanic Cloud (three words) pretty lights -> aurora same length -> equinox definitely not the same length -> solstice kaboom -> supernova a few stars in orion -> rigel a radius -> schwarzschild claudius -> ptolemy harry potter character -> bellatrix not space -> terrestrial The answer: ######qpiusarorc Level 10: Clues: USENA KLFEU SENAK NAKUS ENAKN AKUSE NAKLF EUSED LEDLE USENA KNAKU SENAK LFEUS EENQS UBSOU DC1SO UESCE OTESC | 3 | bpp | ignore padding | not thematic | the answer is not just garbage, but might be a bit hard to read | 8 | rotated | 3 As with the previous puzzle, the topic here changed numerous times Editing the first clue a bit yields: USE NAK LFE USE NAK NAK USE NAK NAK USE NAK LFE USE DLE DLE USE NAK NAK USE NAK LFE USE ENQ SUB SOU DC1 SOU ESC EOT ESC These are all ASCII control characters (with additional padding: US [E], SO [U]) People were expected to put the actual characters into a file and look at the binary representation. With one column per byte and groups of three, it becomes (0 removed): 11111 1 1 1 1 1 11111 1 1 1 1 1 1 11111 1 1 1 1 1 1 11111 1 1 1 1 1 11111 1 1 11111 1 1 1 1 1 1 11111 1 1 1 1 1 11111 1 1 11 1 11111 1 1 11111 11 11 1 11 11 The answer: ######Beeblebrox Level 11 Clues: a pioneer(strong) | sun farts | where we are(big picture) | accelerating weight loss(17 across) | a huge structure(largest) | 244 225(8859-7) | sounds similar(star wars) | 07 39 18 11950(05 13 29 9552) | cheese | the big one(sp, 2 words) | the bright one | i.imgur.com/KDiMQ2p.png ← NEW | spaces allowed Words: a pioneer (strong) -> Neil Armstrong sun farts -> solar winds where we are (big picture) -> local group accelerating weight loss -> Hawking Radiation a huge structure (largest) -> filament 244 225(8859-7) -> Aldebaran sounds similar (star wars) -> Alderaan 07 39 18 11950(05 13 29 9552) -> Procyon cheese -> moon the big one (sp, 2 words) -> El Gordo the bright one -> Sirius The answer: ######iaroamegac Level 12 Clues: https://is.gd/nMYVhB | https://is.gd/N5ogMy | blue The puzzle in the picture is a Nonogram, solving it gets you a QR -code Scanning the QR -code reveals the message \"Спутник-1\" Find Baikonur Cosmodrome on the Wikipedia page for Спутник-1 (Sputnik 1) The answer: ######BaikonurCosmodrome","tags":"solutions","title":"2016 April Fool's Day ( AFD ) Summary & Solutions"},{"url":"2017/03/2017-april-fools-day-afd-competition/","text":"Glad 2016 is over? Well, we are happy to present the 2017 IRCPuzzles April Fool's Day Challenge on freenode ! It will begin at 2017-04-01 12:00 UTC (noon). The first clue for Level 0 will be released in #ircpuzzles on freenode and on our Twitter page, @ircpuzzles . Join us in #ircpuzzles on freenode.net and chat with everybody before, during, and even after the comptetition! Good luck!","tags":"updates","title":"2017 April Fool's Day ( AFD ) Competition"},{"url":"2016/04/april-fools-day-challenge-is-now-live/","text":"We are happy to present the 2016 IRCPuzzles April Fool's Day Challenge on freenode ! It has begun! The first clue is: IyMjIyMjQUZEMjAxNlN0YXJ0 Please join us in #ircpuzzles on freenode.","tags":"updates","title":"April Fool's Day Challenge Is Now LIVE"},{"url":"2016/04/announcement-2016-competition/","text":"We are happy to present the 2016 IRCPuzzles April Fool's Day Challenge on freenode ! It will begin at 2016-04-01 12:00 UTC (noon). The first clue for Level 0 will be released at least on our Twitter page of @ircpuzzles . It may also be released or announced via the freenode blog , freenode's twitter page @freenodestaff , freenode wallop, or freenode global announcement. Join us in #ircpuzzles on freenode.net and chat with everybody before, during, and even after the comptetition! The prizes for completing this year have yet to be finalized and will most likely be group cloaks representing individual placement in the contest. Good luck!","tags":"updates","title":"Announcement: 2016 Competition!"}]}